[Basic Data Exploration](#basic-explor)

[Bivariate analysis](#bivar)

## Course Structure

1. Module 0 - Native Data Types in Python
2. Module 1 - Intro to Pandas library & Basis Dataframe attributes
3. Module 2 - Common Data manipulation tasks using Pandas
4. Module 3 - Loops and Functions 
5. Module 4 - Visualization
6. Module 5 - Other miscellaneous topics

# Basic data types

In [459]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [460]:
# List, Dictionary, Tuple
mylist = [20,30,40,50,60,70]
print("Excludes first element: ")
mylist[1:]
print("Excludes last element: ")
mylist[:-1]
print("Outputs in reverse order: ")
mylist[::-1]

Excludes first element:

[30, 40, 50, 60, 70]

Excludes last element:

[20, 30, 40, 50, 60]

Outputs in reverse order:

[70, 60, 50, 40, 30, 20]

In [461]:
x = [1,"b",3]

In [462]:
x[1]

'b'

In [463]:
dict = {"Raghu":"Trainer","You":"participants",3:"My number"}
dict[3]
dict.keys()
dict.values()
dict[list(dict.keys())[0]]

'My number'

dict_keys(['Raghu', 'You', 3])

dict_values(['Trainer', 'participants', 'My number'])

'Trainer'

In [464]:
students = {"s_1":["IBM"],"s_2":["INFY","WIPRO","GOOGLE"]}
students["s_2"][2]

'GOOGLE'

In [465]:
student_dict = {"s_1":["IBM","TCS"],"s_2" :["HP"], "s_3":["INFOSYS","WIPRO"]}

In [466]:
[val for k,val in student_dict.items()]

[['IBM', 'TCS'], ['HP'], ['INFOSYS', 'WIPRO']]

In [467]:
x = ["abe",1,"c"]

In [468]:
dist_ex = {"S1":["HCL","TCS"],"S2":["Benz"]}

In [469]:
for k,v in dist_ex.items():
    if k == "S1":
        print(k)

S1

In [470]:
x.append("h")

In [471]:
x

['abe', 1, 'c', 'h']

In [472]:
tup_ex = (1,2,3,1)
mylist = [1,2,3,4,5]
mylist.append(7)
for i in tup_ex: mylist.append(i) 
mylist

[1, 2, 3, 4, 5, 7, 1, 2, 3, 1]

In [473]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [474]:
list_ex = [1,2,3]
dist_ex = {"Age":25,"Weight":70}
tup_ex = (1,2,3,1)

## Imports the package that gives the ability to manipulate CSV files

In [475]:
from pandas import read_csv

## Reads data

In [476]:
# read the data
import pandas as pd
df = pd.read_csv(r"C:\Users\khait\Downloads\Courses\Course 1\Resources\customers-10000.csv")

## Show data type of dataframe

In [477]:
type(df)

pandas.core.frame.DataFrame

## Shows data

In [478]:
df

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26,http://www.escobar.org/
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27,https://tyler-pugh.info/
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22,https://www.mack-bell.net/
3,4,6d350C5E5eDB4EE,Patty,Ponce,Richardson Group,East Kristintown,Northern Mariana Islands,302.398.3833,196-189-7767x770,hohailey@anthony.com,2020-07-02,https://delacruz-freeman.org/
4,5,5820deAdCF23EFe,Kathleen,Mccormick,Carson-Burch,Andresmouth,Macao,001-184-153-9683x1497,552.051.2979x342,alvaradojesse@rangel-shields.com,2021-01-17,https://welch.info/
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,DD0caa06ebf217c,Meghan,Cline,Richardson LLC,Petersport,Cote d'Ivoire,001-270-136-4738x419,001-349-692-1755x055,nicolasandrade@bates.info,2022-04-27,http://thomas-ramos.com/
9996,9997,C1C62ff90D0AfED,Jeremiah,Pena,Hodge-Nixon,Briggsport,Namibia,+1-531-494-7645x4844,001-295-324-5502x5411,tracy68@wade.com,2022-01-17,https://www.campbell.com/
9997,9998,2EfAa6Fe435A7DA,Peggy,Key,Vang LLC,West Joyceport,United States Virgin Islands,520.109.2482x26052,+1-602-934-5901x95106,mclaughlinjulia@barnett-dorsey.com,2022-01-13,http://www.george-scott.com/
9998,9999,5dB06C3Fab5CCCb,Evan,Humphrey,Gould Ltd,Camachochester,Niger,001-465-242-9979,001-639-955-2116x751,velazquezjessica@villegas-wilcox.com,2020-04-14,https://www.payne.info/
9999,10000,9903e8fF4D8Ff0F,Melissa,Montgomery,Burns-Holden,Sparkstown,Tunisia,+1-889-682-9490x65400,423.632.2539x98740,ngallagher@martinez.com,2020-06-27,http://nixon.net/

# Key Modules

1. Basic Dataframe operations
2. Common data manipulation tasks
3. Loops and Functions

## Basic dataframe operations

## Shows first 5 lines of data

In [479]:
df.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26,http://www.escobar.org/
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27,https://tyler-pugh.info/
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22,https://www.mack-bell.net/
3,4,6d350C5E5eDB4EE,Patty,Ponce,Richardson Group,East Kristintown,Northern Mariana Islands,302.398.3833,196-189-7767x770,hohailey@anthony.com,2020-07-02,https://delacruz-freeman.org/
4,5,5820deAdCF23EFe,Kathleen,Mccormick,Carson-Burch,Andresmouth,Macao,001-184-153-9683x1497,552.051.2979x342,alvaradojesse@rangel-shields.com,2021-01-17,https://welch.info/

## Shows number of (rows, columns)

In [480]:
df.shape

(10000, 12)

In [481]:
hasattr(df,"head")
x = getattr(df,"head")
print(x)

True

<bound method NDFrame.head of       Index      Customer Id First Name   Last Name                   Company  \
0         1  EB54EF1154C3A78    Heather    Callahan              Mosley-David
1         2  10dAcafEBbA5FcA   Kristina     Ferrell  Horn, Shepard and Watson
2         3  67DAB15Ebe4BE4a     Briana    Andersen               Irwin-Oneal
3         4  6d350C5E5eDB4EE      Patty       Ponce          Richardson Group
4         5  5820deAdCF23EFe   Kathleen   Mccormick              Carson-Burch
...     ...              ...        ...         ...                       ...
9995   9996  DD0caa06ebf217c     Meghan       Cline            Richardson LLC
9996   9997  C1C62ff90D0AfED   Jeremiah        Pena               Hodge-Nixon
9997   9998  2EfAa6Fe435A7DA      Peggy         Key                  Vang LLC
9998   9999  5dB06C3Fab5CCCb       Evan    Humphrey                 Gould Ltd
9999  10000  9903e8fF4D8Ff0F    Melissa  Montgomery              Burns-Holden

                  City                       Country                Phone 1  \
0     Lake Jeffborough                        Norway           043-797-5229
1           Aaronville                       Andorra           932-062-1802
2          East Jordan                         Nepal             8352752061
3     East Kristintown      Northern Mariana Islands           302.398.3833
4          Andresmouth                         Macao  001-184-153-9683x1497
...                ...                           ...                    ...
9995        Petersport                 Cote d'Ivoire   001-270-136-4738x419
9996        Briggsport                       Namibia   +1-531-494-7645x4844
9997    West Joyceport  United States Virgin Islands     520.109.2482x26052
9998    Camachochester                         Niger       001-465-242-9979
9999        Sparkstown                       Tunisia  +1-889-682-9490x65400

                    Phone 2                                 Email  \
0              915.112.1727          urangel@espinoza-francis.net
1        (209)172-7124x3651               xreese@hall-donovan.com
2             (567)135-1918         haleybraun@blevins-sexton.com
3          196-189-7767x770                  hohailey@anthony.com
4          552.051.2979x342      alvaradojesse@rangel-shields.com
...                     ...                                   ...
9995   001-349-692-1755x055             nicolasandrade@bates.info
9996  001-295-324-5502x5411                      tracy68@wade.com
9997  +1-602-934-5901x95106    mclaughlinjulia@barnett-dorsey.com
9998   001-639-955-2116x751  velazquezjessica@villegas-wilcox.com
9999     423.632.2539x98740               ngallagher@martinez.com

     Subscription Date                        Website
0           2020-08-26        http://www.escobar.org/
1           2020-04-27       https://tyler-pugh.info/
2           2022-03-22     https://www.mack-bell.net/
3           2020-07-02  https://delacruz-freeman.org/
4           2021-01-17            https://welch.info/
...                ...                            ...
9995        2022-04-27       http://thomas-ramos.com/
9996        2022-01-17      https://www.campbell.com/
9997        2022-01-13   http://www.george-scott.com/
9998        2020-04-14        https://www.payne.info/
9999        2020-06-27              http://nixon.net/

[10000 rows x 12 columns]>

## Shows last 5 lines of data

In [482]:
df.tail()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
9995,9996,DD0caa06ebf217c,Meghan,Cline,Richardson LLC,Petersport,Cote d'Ivoire,001-270-136-4738x419,001-349-692-1755x055,nicolasandrade@bates.info,2022-04-27,http://thomas-ramos.com/
9996,9997,C1C62ff90D0AfED,Jeremiah,Pena,Hodge-Nixon,Briggsport,Namibia,+1-531-494-7645x4844,001-295-324-5502x5411,tracy68@wade.com,2022-01-17,https://www.campbell.com/
9997,9998,2EfAa6Fe435A7DA,Peggy,Key,Vang LLC,West Joyceport,United States Virgin Islands,520.109.2482x26052,+1-602-934-5901x95106,mclaughlinjulia@barnett-dorsey.com,2022-01-13,http://www.george-scott.com/
9998,9999,5dB06C3Fab5CCCb,Evan,Humphrey,Gould Ltd,Camachochester,Niger,001-465-242-9979,001-639-955-2116x751,velazquezjessica@villegas-wilcox.com,2020-04-14,https://www.payne.info/
9999,10000,9903e8fF4D8Ff0F,Melissa,Montgomery,Burns-Holden,Sparkstown,Tunisia,+1-889-682-9490x65400,423.632.2539x98740,ngallagher@martinez.com,2020-06-27,http://nixon.net/

## Shows data type of each "series" {column}

In [483]:
df.dtypes

Index                 int64
Customer Id          object
First Name           object
Last Name            object
Company              object
City                 object
Country              object
Phone 1              object
Phone 2              object
Email                object
Subscription Date    object
Website              object
dtype: object

### Changing data types

## Create a data frame from your own definition

In [484]:
temp = pd.DataFrame({"A":["1","2","3"],"B":[11,12,13],"C": ["12-06-2012","13-06-2015","15-06-2017"]})

## Shows newly created data frame

##

In [485]:
temp

   A   B           C
0  1  11  12-06-2012
1  2  12  13-06-2015
2  3  13  15-06-2017

### Shows data types

In [486]:
temp.dtypes

A    object
B     int64
C    object
dtype: object

# Testing out conversion to datetime

In [487]:
pd.to_datetime("2002-feb-02")

Timestamp('2002-02-02 00:00:00')

In [488]:
temp["C"] = pd.to_datetime(temp["C"],format='%d-%m-%Y')
temp
temp.dtypes
pd.to_datetime(["2016-sep-11","abc"],format='%Y-%b-%d',errors='coerce')

   A   B          C
0  1  11 2012-06-12
1  2  12 2015-06-13
2  3  13 2017-06-15

A            object
B             int64
C    datetime64[ns]
dtype: object

DatetimeIndex(['2016-09-11', 'NaT'], dtype='datetime64[ns]', freq=None)

In [489]:
temp["A"] = pd.to_numeric(temp["A"])
temp

   A   B          C
0  1  11 2012-06-12
1  2  12 2015-06-13
2  3  13 2017-06-15

In [490]:
temp.dtypes

A             int64
B             int64
C    datetime64[ns]
dtype: object

In [491]:

temp["A"] = temp["A"].astype(str)

In [492]:
temp.dtypes

A            object
B             int64
C    datetime64[ns]
dtype: object

In [493]:
# convert data to datetime format
pd.to_datetime(df["Subscription Date"],format='%Y-%m-%d',errors="coerce")
# Available time formats: https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

0      2020-08-26
1      2020-04-27
2      2022-03-22
3      2020-07-02
4      2021-01-17
          ...
9995   2022-04-27
9996   2022-01-17
9997   2022-01-13
9998   2020-04-14
9999   2020-06-27
Name: Subscription Date, Length: 10000, dtype: datetime64[ns]

### Dataset summarization methods

In [494]:
df.describe(include="all")

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
count,10000.00000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000
unique,NaN,10000,690,1000,9215,8910,243,10000,10000,10000,880,8315
top,NaN,EB54EF1154C3A78,Julie,Dunlap,Perry LLC,South Edwin,Korea,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-04-13,http://www.cordova.com/
freq,NaN,1,25,23,4,4,84,1,1,1,24,6
mean,5000.50000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,2886.89568,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,2500.75000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,5000.50000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,7500.25000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,10000.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [495]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Index              10000 non-null  int64
 1   Customer Id        10000 non-null  object
 2   First Name         10000 non-null  object
 3   Last Name          10000 non-null  object
 4   Company            10000 non-null  object
 5   City               10000 non-null  object
 6   Country            10000 non-null  object
 7   Phone 1            10000 non-null  object
 8   Phone 2            10000 non-null  object
 9   Email              10000 non-null  object
 10  Subscription Date  10000 non-null  object
 11  Website            10000 non-null  object
dtypes: int64(1), object(11)
memory usage: 937.6+ KB

In [496]:
# count of unique start locations
df["City"].value_counts().head()

City
South Edwin       4
South Steve       4
Port Catherine    4
Eileenmouth       4
New Kayla         4
Name: count, dtype: int64

## Common data manipulation tasks

5 verbs of data manipulation

1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/ Conditionally adding columns
5. Groupby/Summarize

### Select/Indexing

## So the one in the inside square brackets represents individual columns/rows

In [497]:
df.iloc[0:4,[0,3]]

   Index Last Name
0      1  Callahan
1      2   Ferrell
2      3  Andersen
3      4     Ponce

## These both are representing ranges of columns and rows

In [498]:
## Positional Indexing
df.iloc[0:4,0:3]

   Index      Customer Id First Name
0      1  EB54EF1154C3A78    Heather
1      2  10dAcafEBbA5FcA   Kristina
2      3  67DAB15Ebe4BE4a     Briana
3      4  6d350C5E5eDB4EE      Patty

### This shows all the rows but specific columns

In [499]:
df.iloc[:,0:3]

      Index      Customer Id First Name
0         1  EB54EF1154C3A78    Heather
1         2  10dAcafEBbA5FcA   Kristina
2         3  67DAB15Ebe4BE4a     Briana
3         4  6d350C5E5eDB4EE      Patty
4         5  5820deAdCF23EFe   Kathleen
...     ...              ...        ...
9995   9996  DD0caa06ebf217c     Meghan
9996   9997  C1C62ff90D0AfED   Jeremiah
9997   9998  2EfAa6Fe435A7DA      Peggy
9998   9999  5dB06C3Fab5CCCb       Evan
9999  10000  9903e8fF4D8Ff0F    Melissa

[10000 rows x 3 columns]

### This shows all the columns but specific rows

In [500]:
df.iloc[0:3,]

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26,http://www.escobar.org/
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27,https://tyler-pugh.info/
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22,https://www.mack-bell.net/

## See how the column isn't removed when u reprint the table

In [501]:
df.iloc[:,:-1]
df

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22
3,4,6d350C5E5eDB4EE,Patty,Ponce,Richardson Group,East Kristintown,Northern Mariana Islands,302.398.3833,196-189-7767x770,hohailey@anthony.com,2020-07-02
4,5,5820deAdCF23EFe,Kathleen,Mccormick,Carson-Burch,Andresmouth,Macao,001-184-153-9683x1497,552.051.2979x342,alvaradojesse@rangel-shields.com,2021-01-17
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,DD0caa06ebf217c,Meghan,Cline,Richardson LLC,Petersport,Cote d'Ivoire,001-270-136-4738x419,001-349-692-1755x055,nicolasandrade@bates.info,2022-04-27
9996,9997,C1C62ff90D0AfED,Jeremiah,Pena,Hodge-Nixon,Briggsport,Namibia,+1-531-494-7645x4844,001-295-324-5502x5411,tracy68@wade.com,2022-01-17
9997,9998,2EfAa6Fe435A7DA,Peggy,Key,Vang LLC,West Joyceport,United States Virgin Islands,520.109.2482x26052,+1-602-934-5901x95106,mclaughlinjulia@barnett-dorsey.com,2022-01-13
9998,9999,5dB06C3Fab5CCCb,Evan,Humphrey,Gould Ltd,Camachochester,Niger,001-465-242-9979,001-639-955-2116x751,velazquezjessica@villegas-wilcox.com,2020-04-14
9999,10000,9903e8fF4D8Ff0F,Melissa,Montgomery,Burns-Holden,Sparkstown,Tunisia,+1-889-682-9490x65400,423.632.2539x98740,ngallagher@martinez.com,2020-06-27

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26,http://www.escobar.org/
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27,https://tyler-pugh.info/
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22,https://www.mack-bell.net/
3,4,6d350C5E5eDB4EE,Patty,Ponce,Richardson Group,East Kristintown,Northern Mariana Islands,302.398.3833,196-189-7767x770,hohailey@anthony.com,2020-07-02,https://delacruz-freeman.org/
4,5,5820deAdCF23EFe,Kathleen,Mccormick,Carson-Burch,Andresmouth,Macao,001-184-153-9683x1497,552.051.2979x342,alvaradojesse@rangel-shields.com,2021-01-17,https://welch.info/
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,DD0caa06ebf217c,Meghan,Cline,Richardson LLC,Petersport,Cote d'Ivoire,001-270-136-4738x419,001-349-692-1755x055,nicolasandrade@bates.info,2022-04-27,http://thomas-ramos.com/
9996,9997,C1C62ff90D0AfED,Jeremiah,Pena,Hodge-Nixon,Briggsport,Namibia,+1-531-494-7645x4844,001-295-324-5502x5411,tracy68@wade.com,2022-01-17,https://www.campbell.com/
9997,9998,2EfAa6Fe435A7DA,Peggy,Key,Vang LLC,West Joyceport,United States Virgin Islands,520.109.2482x26052,+1-602-934-5901x95106,mclaughlinjulia@barnett-dorsey.com,2022-01-13,http://www.george-scott.com/
9998,9999,5dB06C3Fab5CCCb,Evan,Humphrey,Gould Ltd,Camachochester,Niger,001-465-242-9979,001-639-955-2116x751,velazquezjessica@villegas-wilcox.com,2020-04-14,https://www.payne.info/
9999,10000,9903e8fF4D8Ff0F,Melissa,Montgomery,Burns-Holden,Sparkstown,Tunisia,+1-889-682-9490x65400,423.632.2539x98740,ngallagher@martinez.com,2020-06-27,http://nixon.net/

## In order to actually remove it when called seperately you need to assign it to a new variable

In [502]:
Armaan  = df.iloc[:,:-1]
Armaan

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date
0,1,EB54EF1154C3A78,Heather,Callahan,Mosley-David,Lake Jeffborough,Norway,043-797-5229,915.112.1727,urangel@espinoza-francis.net,2020-08-26
1,2,10dAcafEBbA5FcA,Kristina,Ferrell,"Horn, Shepard and Watson",Aaronville,Andorra,932-062-1802,(209)172-7124x3651,xreese@hall-donovan.com,2020-04-27
2,3,67DAB15Ebe4BE4a,Briana,Andersen,Irwin-Oneal,East Jordan,Nepal,8352752061,(567)135-1918,haleybraun@blevins-sexton.com,2022-03-22
3,4,6d350C5E5eDB4EE,Patty,Ponce,Richardson Group,East Kristintown,Northern Mariana Islands,302.398.3833,196-189-7767x770,hohailey@anthony.com,2020-07-02
4,5,5820deAdCF23EFe,Kathleen,Mccormick,Carson-Burch,Andresmouth,Macao,001-184-153-9683x1497,552.051.2979x342,alvaradojesse@rangel-shields.com,2021-01-17
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,DD0caa06ebf217c,Meghan,Cline,Richardson LLC,Petersport,Cote d'Ivoire,001-270-136-4738x419,001-349-692-1755x055,nicolasandrade@bates.info,2022-04-27
9996,9997,C1C62ff90D0AfED,Jeremiah,Pena,Hodge-Nixon,Briggsport,Namibia,+1-531-494-7645x4844,001-295-324-5502x5411,tracy68@wade.com,2022-01-17
9997,9998,2EfAa6Fe435A7DA,Peggy,Key,Vang LLC,West Joyceport,United States Virgin Islands,520.109.2482x26052,+1-602-934-5901x95106,mclaughlinjulia@barnett-dorsey.com,2022-01-13
9998,9999,5dB06C3Fab5CCCb,Evan,Humphrey,Gould Ltd,Camachochester,Niger,001-465-242-9979,001-639-955-2116x751,velazquezjessica@villegas-wilcox.com,2020-04-14
9999,10000,9903e8fF4D8Ff0F,Melissa,Montgomery,Burns-Holden,Sparkstown,Tunisia,+1-889-682-9490x65400,423.632.2539x98740,ngallagher@martinez.com,2020-06-27

In [503]:
# label based indexing
df.loc[:,["City","Country"]]

                  City                       Country
0     Lake Jeffborough                        Norway
1           Aaronville                       Andorra
2          East Jordan                         Nepal
3     East Kristintown      Northern Mariana Islands
4          Andresmouth                         Macao
...                ...                           ...
9995        Petersport                 Cote d'Ivoire
9996        Briggsport                       Namibia
9997    West Joyceport  United States Virgin Islands
9998    Camachochester                         Niger
9999        Sparkstown                       Tunisia

[10000 rows x 2 columns]

#### This is a shorthand made by the developers of the library to make it easier to use making it so that you don't need to use the .loc command. You can simply write dc[[and your columns names]] in order to get all rows but specific columns

In [504]:
df[["City","Country"]]

                  City                       Country
0     Lake Jeffborough                        Norway
1           Aaronville                       Andorra
2          East Jordan                         Nepal
3     East Kristintown      Northern Mariana Islands
4          Andresmouth                         Macao
...                ...                           ...
9995        Petersport                 Cote d'Ivoire
9996        Briggsport                       Namibia
9997    West Joyceport  United States Virgin Islands
9998    Camachochester                         Niger
9999        Sparkstown                       Tunisia

[10000 rows x 2 columns]

#### This shows a series

In [505]:
abc  = df.loc[:,"City"]
abc

0       Lake Jeffborough
1             Aaronville
2            East Jordan
3       East Kristintown
4            Andresmouth
              ...
9995          Petersport
9996          Briggsport
9997      West Joyceport
9998      Camachochester
9999          Sparkstown
Name: City, Length: 10000, dtype: object

#### As proven here by checking its type

In [506]:
type(abc)

pandas.core.series.Series

#### Writing it like this keeps it as a dataframe

In [507]:
abc  = df.loc[:,["City","Country"]]
abc

                  City                       Country
0     Lake Jeffborough                        Norway
1           Aaronville                       Andorra
2          East Jordan                         Nepal
3     East Kristintown      Northern Mariana Islands
4          Andresmouth                         Macao
...                ...                           ...
9995        Petersport                 Cote d'Ivoire
9996        Briggsport                       Namibia
9997    West Joyceport  United States Virgin Islands
9998    Camachochester                         Niger
9999        Sparkstown                       Tunisia

[10000 rows x 2 columns]

#### As seen when checked here

In [508]:
type(abc)

pandas.core.frame.DataFrame

### This is important because all the function that work on a dataframe may not work on a series

In [509]:
df.loc[0:4,["City","Country"]]

               City                   Country
0  Lake Jeffborough                    Norway
1        Aaronville                   Andorra
2       East Jordan                     Nepal
3  East Kristintown  Northern Mariana Islands
4       Andresmouth                     Macao

In [510]:
df.columns

Index(['Index', 'Customer Id', 'First Name', 'Last Name', 'Company', 'City',
       'Country', 'Phone 1', 'Phone 2', 'Email', 'Subscription Date',
       'Website'],
      dtype='object')

### In Class assignment

Extract first 5 rows and columns City and Country

In [511]:
df.loc[0:5,["City","Country"]]

                 City                   Country
0    Lake Jeffborough                    Norway
1          Aaronville                   Andorra
2         East Jordan                     Nepal
3    East Kristintown  Northern Mariana Islands
4         Andresmouth                     Macao
5  Lake Madelineburgh                   Senegal

### Filtering

### This is important. Using loc you can filter the row or column within the square bracket. But if you use the just"df" shorthand it applies to the entire dataframe. The only way to alter it is to remove columns or rows and assign that to a new variable then reapply the df shorthand again

In [512]:
df2 = df.loc[df["Index"] > 10,["Country"]]
df2

                           Country
10                      Mauritania
11                          Gambia
12                          Sweden
13                     Netherlands
14              Dominican Republic
...                            ...
9995                 Cote d'Ivoire
9996                       Namibia
9997  United States Virgin Islands
9998                         Niger
9999                       Tunisia

[9990 rows x 1 columns]

In [513]:
df3 = df2.loc[0:3]

In [514]:
# find out all rides greater than 10 miles
df.loc[df["Index"] > 10].head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
10,11,9653ca648e2E414,Martin,Hawkins,Lopez Inc,Lake Bobton,Mauritania,001-402-567-1320,732-908-7945,danielbuckley@hatfield.info,2021-05-02,https://www.newman.com/
11,12,e586A2D67bcdB48,Sara,Shaffer,"Dudley, Coleman and Green",Orrland,Gambia,4229986278,001-028-824-7381x56737,gabrielaleach@rose.net,2021-04-07,https://www.hoffman-rubio.com/
12,13,c388ECa44FFe37c,Dave,Moran,Harrell-Donovan,South Elizabeth,Sweden,575.006.7250x9748,262-029-1096,cartermallory@chung.com,2020-02-28,https://hinton.info/
13,14,f8dddbf9CD6FF92,Glen,Hammond,"Schaefer, Chung and Lin",Pamelatown,Netherlands,001-887-543-3745x055,001-955-888-1987x09071,lweeks@hooper.org,2022-03-03,https://bush-huynh.org/
14,15,86Df56BFCc0a7CA,Catherine,Blackwell,"Mack, Garcia and Schaefer",Lake Seth,Dominican Republic,001-915-961-8896x5744,(310)185-3032x0974,calhounalisha@hardin.net,2021-03-30,https://barker-bishop.info/

In [515]:
# Find out all customers with first name Glen and last name Hammond
df.loc[(df["First Name"]=="Glen")&(df["Last Name"]=="Hammond"),["Phone 1"]].head()

                 Phone 1
13  001-887-543-3745x055

In [516]:
df = pd.read_csv(r"C:\Users\khait\Downloads\Courses\Course 1\Resources\Uber Drives 2016 (1).csv")

#### In class assignment

1. Find all trips with distance > 10 miles and originating from Cary and Morris.

2. Extract top 3 rows from the filtered dataset

In [ ]:
df3 = df.loc[(df["MILES*"] > 10) & ((df["START*"]=="Cary")|(df["START*"]=="New York"))].head(3)
df3 = df3.drop(columns=['level_0'],errors='ignore')
df3.reset_index(inplace=True,drop=True)
df3 = df3.drop(columns=['index'],errors='ignore')
df3

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat
0,1/10/2016 15:08,1/10/2016 15:51,Business,New York,Queens,10.8,Meeting,Long Trip
1,1/12/2016 16:02,1/12/2016 17:00,Business,New York,Queens County,15.1,Meeting,Long Trip
2,1/15/2016 11:43,1/15/2016 12:03,Business,Cary,Durham,10.4,Meal/Entertain,Long Trip

### Sorting

In [532]:
df.sort_values(by=["MILES*"],ascending=False).head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN,Long Trip
269,3/25/2016 16:52,3/25/2016 22:22,Business,Latta,Jacksonville,310.3,Customer Visit,Long Trip
270,3/25/2016 22:54,3/26/2016 1:39,Business,Jacksonville,Kissimmee,201.0,Meeting,Long Trip
881,10/30/2016 15:22,10/30/2016 18:23,Business,Asheville,Mebane,195.9,NaN,Long Trip
776,9/27/2016 21:01,9/28/2016 2:37,Business,Unknown Location,Unknown Location,195.6,NaN,Long Trip

In [593]:
df.sort_values(by=["START*", "MILES*"],ascending=[True,False]).head(20)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat
906,11/4/2016 21:04,11/4/2016 21:20,Business,Agnew,Cory,4.3,NaN,Short Trip
911,11/6/2016 10:50,11/6/2016 11:04,Business,Agnew,Renaissance,2.4,NaN,Short Trip
908,11/5/2016 8:34,11/5/2016 8:43,Business,Agnew,Renaissance,2.2,NaN,Short Trip
910,11/5/2016 19:20,11/5/2016 19:28,Business,Agnew,Agnew,2.2,NaN,Short Trip
879,10/30/2016 12:58,10/30/2016 13:18,Business,Almond,Bryson City,15.2,NaN,Long Trip
1001,11/26/2016 17:36,11/26/2016 17:56,Business,Apex,Holly Springs,9.0,Meeting,Long Trip
1033,12/9/2016 13:15,12/9/2016 13:43,Business,Apex,Cary,8.8,Temporary Site,Long Trip
410,6/6/2016 21:08,6/6/2016 21:37,Business,Apex,Cary,7.2,Meal/Entertain,Long Trip
647,8/10/2016 19:47,8/10/2016 20:02,Business,Apex,Cary,6.0,NaN,Long Trip
60,1/30/2016 18:09,1/30/2016 18:24,Business,Apex,Cary,5.7,Customer Visit,Long Trip
80,2/7/2016 18:03,2/7/2016 18:17,Business,Apex,Cary,5.7,Customer Visit,Long Trip
173,2/29/2016 12:36,2/29/2016 12:48,Business,Apex,Cary,5.6,Meeting,Long Trip
58,1/29/2016 21:21,1/29/2016 21:40,Business,Apex,Cary,5.5,Meal/Entertain,Long Trip
565,7/18/2016 18:32,7/18/2016 18:47,Business,Apex,Cary,5.5,Meal/Entertain,Long Trip
978,11/19/2016 21:14,11/19/2016 21:35,Business,Apex,Cary,5.4,Customer Visit,Long Trip
826,10/17/2016 19:08,10/17/2016 19:25,Business,Apex,Cary,5.3,NaN,Long Trip
1014,12/2/2016 13:07,12/2/2016 13:22,Business,Apex,Cary,5.3,Customer Visit,Long Trip
1045,12/12/2016 14:26,12/12/2016 14:39,Business,Apex,Cary,4.7,Customer Visit,Short Trip
616,8/1/2016 15:40,8/1/2016 15:47,Business,Apex,Cary,4.6,NaN,Short Trip
825,10/17/2016 18:31,10/17/2016 18:45,Business,Apex,Apex,3.3,NaN,Short Trip

### Conditionally adding columns

In [520]:
import numpy as np
df["miles_cat"] = np.where(df["MILES*"] > 5,"Long Trip","Short Trip")

In [598]:
df.head(3)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Long Trip
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN,Short Trip
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Short Trip

In [522]:
df["miles_cat"].value_counts()

miles_cat
Long Trip     654
Short Trip    502
Name: count, dtype: int64

In [597]:
df.loc[df["MILES*"] > 5].shape

(654, 8)

## In class Assignment

Create a new column with the following condition:

a) > 10 - Long Trip

b) 5 - 10  - Medium

c) < 5 - Short Trip

In [600]:
df["classAssignment"] = np.where(df["MILES*"]>10,"Long Trip",np.where((df["MILES*"]<=10)&(df["MILES*"]>=5), "Medium","Short Trip"))
df

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat,classAssignment
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Long Trip,Medium
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN,Short Trip,Medium
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Short Trip,Short Trip
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting,Short Trip,Short Trip
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,Long Trip,Long Trip
...,...,...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site,Short Trip,Short Trip
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting,Long Trip,Long Trip
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site,Long Trip,Medium
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site,Long Trip,Long Trip
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN,Long Trip,Long Trip

### Groupby Summarize

In [618]:
# for each start loc find the mean distance travelled
df.groupby("START*")["MILES*"].agg("mean")

START*
Agnew                2.775000
Almond              15.200000
Apex                 5.341176
Arabi               17.000000
Arlington            4.900000
                      ...
West University      2.200000
Weston               4.000000
Westpark Place       2.182353
Whitebridge          4.020588
Winston Salem      133.600000
Name: MILES*, Length: 177, dtype: float64

In [624]:
df.head(6)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat,classAssignment
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Long Trip,Medium
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN,Short Trip,Medium
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Short Trip,Short Trip
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting,Short Trip,Short Trip
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,Long Trip,Long Trip
5,1/6/2016 17:15,1/6/2016 17:19,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain,Short Trip,Short Trip

In [623]:
# for each start loc find the mean & the total dist travelled
df.groupby(["START*","STOP*"])["MILES*"].agg(["mean","sum"]).head(20)

                                                           mean    sum
START*                    STOP*
Agnew                     Agnew                        2.200000    2.2
                          Cory                         4.300000    4.3
                          Renaissance                  2.300000    4.6
Almond                    Bryson City                 15.200000   15.2
Apex                      Apex                         2.150000    4.3
                          Cary                         5.792308   75.3
                          Eagle Rock                   2.200000    2.2
                          Holly Springs                9.000000    9.0
Arabi                     Metairie                    17.000000   17.0
Arlington                 Washington                   4.900000    4.9
Arlington Park at Amberly Lexington Park at Amberly    1.300000    1.3
Asheville                 Mebane                     195.900000  195.9
                          Topton                      91.800000   91.8
Austin                    Katy                       136.000000  136.0
Banner Elk                Banner Elk                   6.680000   33.4
                          Boone                       15.100000   15.1
                          Elk Park                    22.400000   22.4
                          Newland                     28.100000   28.1
Bellevue                  Seattle                     12.900000   12.9
Berkeley                  El Cerrito                   2.300000    2.3

### In class assignment

Find most recent & the earliest travelled date and mean distance traveled for each start city

In [657]:
df  = df.iloc[:-1,:]
df["START_DATE*"] = pd.to_datetime(df["START_DATE*"])
df.groupby(["START*"]).agg({"MILES*":["mean"],"START_DATE*":["min","max"]}).head(20)

                               MILES*         START_DATE*
                                 mean                 min                 max
START*
Agnew                        2.775000 2016-11-04 21:04:00 2016-11-06 10:50:00
Almond                      15.200000 2016-10-30 12:58:00 2016-10-30 12:58:00
Apex                         5.341176 2016-01-29 21:21:00 2016-12-12 14:26:00
Arabi                       17.000000 2016-06-25 10:50:00 2016-06-25 10:50:00
Arlington                    4.900000 2016-08-02 11:51:00 2016-08-02 11:51:00
Arlington Park at Amberly    1.300000 2016-08-01 13:08:00 2016-08-01 13:08:00
Asheville                  143.850000 2016-10-28 20:13:00 2016-10-30 15:22:00
Austin                     136.000000 2016-03-17 12:52:00 2016-03-17 12:52:00
Banner Elk                  12.375000 2016-07-15 11:32:00 2016-07-17 11:23:00
Bellevue                    12.900000 2016-05-05 23:55:00 2016-05-05 23:55:00
Berkeley                    14.375000 2016-06-13 18:54:00 2016-11-17 10:13:00
Boone                      102.000000 2016-07-16 19:42:00 2016-07-17 12:20:00
Briar Meadow                 9.600000 2016-03-20 18:45:00 2016-03-20 18:45:00
Bryson City                 20.820000 2016-10-30 09:07:00 2016-10-30 13:24:00
Burtrose                     4.800000 2016-04-27 14:13:00 2016-04-27 14:13:00
CBD                          3.850000 2016-06-15 15:26:00 2016-07-10 14:10:00
Capitol One                  9.450000 2016-05-04 21:30:00 2016-05-06 05:47:00
Cary                         8.911940 2016-01-07 13:27:00 2016-12-15 14:20:00
Central                      1.950000 2016-11-09 21:56:00 2016-11-13 15:14:00
Chalmette                    1.100000 2016-06-25 10:18:00 2016-06-25 10:18:00

## Loops and Function

In [ ]:
# Basic for loop
res = []
temp = [1,2,3,4]
for i in temp:
    res.append(i*i)
res

[1, 4, 9, 16]

In [ ]:
# List comprehension way

[x*x for x in temp]

In [ ]:
store_sales = pd.read_csv("store_sales.csv")

In [ ]:
store_sales.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13

In [ ]:
# find out avg sales for each month
# find out avg sales for each store

In [ ]:
def bonus_func(sales_numbers):
    return ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]

In [ ]:
bonus_func([12,23,56])

['Not Eligible', 'Eligible', 'Eligible']

In [ ]:
store_sales.iloc[:,2:].apply(bonus_func).head()

,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,Not Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Eligible,Eligible,Not Eligible,Eligible
1,Not Eligible,Eligible,Eligible,Not Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible
2,Eligible,Eligible,Eligible,Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible
3,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Eligible,Eligible,Eligible,Eligible,Not Eligible
4,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Eligible,Eligible,Eligible

In [ ]:
store_sales.iloc[:,2:].apply(lambda sales_numbers: ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]).head()

,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,Not Eligible,Eligible,Not Eligible,Eligible,Eligible,Eligible,Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible
1,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Eligible
2,Eligible,Eligible,Not Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible
3,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible
4,Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible

In [ ]:
store_sales.columns

Index(['store_id', 'city', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'July',
       'Aug', 'Sep', 'Oct', 'Nov', 'Dec'],
      dtype='object')

In [ ]:
store_sales.groupby("city").agg("mean")

,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
city,,,,,,,,,,,,
Arizona,15.500000,15.272727,14.545455,14.954545,14.090909,15.090909,14.636364,15.500000,15.318182,14.954545,16.409091,13.318182
California,14.744186,15.534884,14.627907,13.976744,13.255814,13.697674,14.813953,16.232558,14.883721,14.279070,15.279070,13.604651
Texas,13.457143,14.428571,14.485714,15.057143,13.600000,13.114286,13.685714,15.485714,14.685714,13.342857,14.657143,13.685714

### Assignments

1) Find mean quarterly sales by store

2) Find the month with highest sales for each store

## Other/Miscellaneous topics

### Missing value treatment

In [ ]:
df.isnull().sum()

START_DATE*      0
END_DATE*        0
CATEGORY*        0
START*           0
STOP*            0
MILES*           0
PURPOSE*       502
dtype: int64

In [ ]:
## Count missing values
df.isnull().sum()

START_DATE*      0
END_DATE*        0
CATEGORY*        0
START*           0
STOP*            0
MILES*           0
PURPOSE*       502
dtype: int64

In [ ]:
# Fill NA with most common values
df["PURPOSE*"].value_counts()

In [ ]:
df = df.fillna({"PURPOSE*":"Meeting"})

In [ ]:
df["PURPOSE*"].value_counts()

### Matrix operations use case

### Example 1 - compute month on month growth in sales

In [ ]:
store_sales.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,13,19,17,10,11,8,5,20,22,22,5,18
1,S_2,California,5,16,21,6,20,17,13,9,5,12,15,16
2,S_3,Texas,18,20,20,19,17,23,9,9,13,7,10,6
3,S_4,Texas,15,10,8,13,22,10,10,21,21,18,17,15
4,S_5,Texas,15,13,10,18,10,15,13,18,15,21,24,19

In [ ]:
sales_mat = np.array(store_sales.iloc[:,2:])

In [ ]:
sales_mat

array([[13, 19, 17, ..., 22,  5, 18],
       [ 5, 16, 21, ..., 12, 15, 16],
       [18, 20, 20, ...,  7, 10,  6],
       ...,
       [ 6, 21, 19, ...,  7, 17, 22],
       [23, 16, 22, ...,  7, 24, 13],
       [14,  5, 16, ...,  6, 22, 15]])

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag

array([[19, 17, 10, ..., 22,  5, 18],
       [16, 21,  6, ..., 12, 15, 16],
       [20, 20, 19, ...,  7, 10,  6],
       ...,
       [21, 19, 21, ...,  7, 17, 22],
       [16, 22,  8, ...,  7, 24, 13],
       [ 5, 16,  9, ...,  6, 22, 15]])

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag = np.c_[sales_mat_lag,np.zeros(100)]

In [ ]:
sales_diff = sales_mat_lag - sales_mat

In [ ]:
perct_change = pd.DataFrame(sales_diff/sales_mat)

In [ ]:
perct_change.head()

### Example 1 - compute net revenue

In [ ]:
profit_mat = np.random.uniform(low=0.05, high=0.25, size=(100,12))

In [ ]:
## Find total annual profit for each store
profit_mat = profit_mat.transpose()

In [ ]:
profit_mat.shape

In [ ]:
prof_matrix = np.dot(sales_mat,profit_mat)

In [ ]:
prof_matrix.shape